/**
 * Created by Weiyan on 2016/11/29.
 */
var hh = $(".citelist").eq(0);
var data=[
    {
        songName:"贝加尔湖畔",
        singerName:"李健",
        time:"04.05",
        music:"img/李健%20-%20贝加尔湖畔.mp3",
        lyric: "[00:00.00] 作曲 : 李健↵[00:01.00] 作词 : 李健↵[00:48.20]在我的怀里 在你的眼里↵[00:56.18]那里春风沉醉 那里绿草如茵↵[01:04.03]月光把爱恋 洒满了湖面↵[01:12.03]两个人的篝火 照亮整个夜晚↵[01:18.70]多少年以后 如云般游走↵[01:26.09]那变换的脚步 让我们难牵手↵[01:33.90]这一生一世 有多少你我↵[01:42.03]被吞没在月光如水的夜里↵[01:52.27]~~~↵[01:53.80]多想某一天 往日又重现↵[02:01.90]我们流连忘返 在贝加尔湖畔↵[02:09.46]~~~↵[02:30.71]~~~↵[02:41.65]多少年以后 往事随云走↵[02:50.34]那纷飞的冰雪容不下那温柔↵[02:58.08]这一生一世 这时间太少↵[03:06.02]不够证明融化冰雪的深情↵[03:16.02]~~~↵[03:17.83]就在某一天 你忽然出现↵[03:26.15]你清澈又神秘 在贝加尔湖畔↵[03:33.83]你清澈又神秘 像贝加尔湖畔↵[03:45.02]↵"

    },
    {
        songName:"追梦人",
        singerName:"罗大佑",
        time:"03.53",
        music:"img/凤飞飞 - 追梦人.mp3",
        lyric:"[00:00.00] 作曲 : 罗大佑↵[00:01.00] 作词 : 罗大佑↵[00:15.898]让青春吹动了你的长发让它牵引你的梦↵[00:24.088]不知不觉这城市的历史已记取了你的笑容↵[00:29.998]↵[00:30.837]红红心中蓝蓝的天是个生命的开始↵[00:38.170]↵[00:39.017]春雨不眠隔夜的你曾空独眠的日子↵[00:46.097]↵[00:47.070]让青春娇艳的花朵绽开了深藏的红颜↵[00:54.570]↵[00:56.090]飞去飞来的满天的飞絮是幻想你的笑脸↵[01:03.696]秋来春去红尘中谁在宿命里安排↵[01:10.380]冰雪不语寒夜的你那难隐藏的光采↵[01:17.177]看我看一眼吧莫让红颜守空枕↵[01:25.048]青春无悔不死永远的爱人↵[01:32.900]让流浪的足迹在荒漠里写下永久的回忆↵[01:41.397]飘去飘来的笔迹是深藏的激情你的心语↵[01:49.198]前尘红世轮回中谁在声音里徘徊↵[01:58.797]痴情笑我凡俗的人世终难解的关怀↵[02:38.519]看我看一眼吧莫让红颜守空枕↵[02:46.498]青春无悔不死永远的爱人↵[02:53.557]让青春吹动了你的长发让它牵引你的梦↵[03:02.670]不知不觉这城市的历史已记取了你的笑容↵[03:10.668]红红心中蓝蓝的天是个生命的开始↵[03:19.170]春雨不眠隔夜的你曾空独眠的日子↵[03:26.277]春雨不眠隔夜的你曾空独眠的日子↵[04:07.297]↵"
    },
    {
        songName:"平凡之路",
        singerName:"朴树",
        // album:"平凡之路",
        // num:3,
        music:"img/朴树 - 平凡之路 (Live) - live.mp3",
        // imge:"images/03.jpg",
        // img:"images/ftb3.png",
        time:"04:55",
        lyric:"[ti:平凡之路]↵[ar:朴树]↵[0-1:54.750]平凡之路↵[00:06.382]徘徊着的在路上的↵[00:11.970]你要走吗via via↵[00:17.764]易碎的骄傲着↵[00:23.477]那也曾是我的模样↵[00:29.163]沸腾着的不安着的↵[00:34.910]你要去哪儿via via↵[00:41.530]谜样的沉着的↵[00:46.376]故事你真的在听吗↵[00:50.806]我曾经跨过山河大海↵[00:54.002]也穿过人山人海↵[00:56.425]我曾经拥有着的一切↵[00:59.482]转眼都飘散如烟↵[01:02.312]我曾经失落失望↵[01:04.466]失掉所有方向↵[01:08.156]直到看见平凡才是唯一的答案↵[01:26.459]当你仍然还在幻想↵[01:32.161]你的明天via via↵[01:38.180]他会很暖还是很冷↵[01:43.241]对我而言是另一天↵[01:47.894]我曾经毁了我的一切↵[01:51.008]只想永远地离开↵[01:54.280]我曾经堕入雾的黑暗↵[01:56.753]想挣扎无法自拔↵[01:59.470]我曾经像你像他像那野草野花↵[02:05.369]绝望着也渴望着↵[02:08.025]也哭也笑平凡着↵[03:19.403]我曾经跨过山河大海↵[03:22.910]也穿过人山人海↵[03:25.075]我曾经拥有着的一切↵[03:28.155]转眼都飘散如烟↵[03:30.847]我曾经失落失望↵[03:33.102]失掉所有方向↵[03:36.569]直到看见平凡才是唯一的答案↵[03:42.366]我曾经毁了我的一切↵[03:45.550]只想永远地离开↵[03:47.995]我曾经堕入雾的黑暗↵[03:50.997]想挣扎无法自拔↵[03:54.010]我曾经像你像他↵[03:55.842]像那野草野花↵[03:59.310]绝望着也渴望着↵[04:02.323]也哭也笑平凡着↵[04:04.840]我曾经跨过山河大海↵[04:08.243]也穿过人山人海↵[04:10.718]我曾经问了整个世界↵[04:13.900]从来没得到答案↵[04:16.500]我不过像你像他↵[04:18.805]像那野草野花↵[04:22.366]冥冥中↵[04:23.976]这是我唯一要走的路啊↵[04:29.303]时间如烟如此这般↵[04:34.856]明天已在yie yie↵[04:40.660]风吹过的如云烟↵[04:46.257]你的故事讲到了哪儿↵"
    }

]

var dataList=[
    {
        songName:"贝加尔湖畔",
        singerName:"李健",
        music:"img/李健%20-%20贝加尔湖畔.mp3",
        lyric: "[00:00.00] 作曲 : 李健↵[00:01.00] 作词 : 李健↵[00:48.20]在我的怀里 在你的眼里↵[00:56.18]那里春风沉醉 那里绿草如茵↵[01:04.03]月光把爱恋 洒满了湖面↵[01:12.03]两个人的篝火 照亮整个夜晚↵[01:18.70]多少年以后 如云般游走↵[01:26.09]那变换的脚步 让我们难牵手↵[01:33.90]这一生一世 有多少你我↵[01:42.03]被吞没在月光如水的夜里↵[01:52.27]~~~↵[01:53.80]多想某一天 往日又重现↵[02:01.90]我们流连忘返 在贝加尔湖畔↵[02:09.46]~~~↵[02:30.71]~~~↵[02:41.65]多少年以后 往事随云走↵[02:50.34]那纷飞的冰雪容不下那温柔↵[02:58.08]这一生一世 这时间太少↵[03:06.02]不够证明融化冰雪的深情↵[03:16.02]~~~↵[03:17.83]就在某一天 你忽然出现↵[03:26.15]你清澈又神秘 在贝加尔湖畔↵[03:33.83]你清澈又神秘 像贝加尔湖畔↵[03:45.02]↵"

    },

    {
        songName:"追梦人",
        singerName:"罗大佑",
        music:"img/凤飞飞 - 追梦人.mp3",
        lyric:"[00:00.00] 作曲 : 罗大佑↵[00:01.00] 作词 : 罗大佑↵[00:15.898]让青春吹动了你的长发让它牵引你的梦↵[00:24.088]不知不觉这城市的历史已记取了你的笑容↵[00:29.998]↵[00:30.837]红红心中蓝蓝的天是个生命的开始↵[00:38.170]↵[00:39.017]春雨不眠隔夜的你曾空独眠的日子↵[00:46.097]↵[00:47.070]让青春娇艳的花朵绽开了深藏的红颜↵[00:54.570]↵[00:56.090]飞去飞来的满天的飞絮是幻想你的笑脸↵[01:03.696]秋来春去红尘中谁在宿命里安排↵[01:10.380]冰雪不语寒夜的你那难隐藏的光采↵[01:17.177]看我看一眼吧莫让红颜守空枕↵[01:25.048]青春无悔不死永远的爱人↵[01:32.900]让流浪的足迹在荒漠里写下永久的回忆↵[01:41.397]飘去飘来的笔迹是深藏的激情你的心语↵[01:49.198]前尘红世轮回中谁在声音里徘徊↵[01:58.797]痴情笑我凡俗的人世终难解的关怀↵[02:38.519]看我看一眼吧莫让红颜守空枕↵[02:46.498]青春无悔不死永远的爱人↵[02:53.557]让青春吹动了你的长发让它牵引你的梦↵[03:02.670]不知不觉这城市的历史已记取了你的笑容↵[03:10.668]红红心中蓝蓝的天是个生命的开始↵[03:19.170]春雨不眠隔夜的你曾空独眠的日子↵[03:26.277]春雨不眠隔夜的你曾空独眠的日子↵[04:07.297]↵"
    }
]




//音乐播放时填充歌词

    function  doingSS(currentTime) {
        for(var i=0;i<dataList.length;i++){
            if($(".datalistName").html() == dataList[i].songName){
                $(".nameM").html($(".datalistName").html());
                doing(dataList,i,currentTime);
            }else{
                for(var i=0;i<data.length;i++){
                    if($(".datalistName").html() == data[i].songName){
                        $(".nameM").html($(".datalistName").html());
                        doing(data,i,currentTime);
                    }
                }
            }
        }
    }

   function  doing(data,a,currentTime){
       var lrcArr = data[a].lyric.match(/\[[\d\:\.]+\].+?↵/gi);
       console.log(lrcArr);
       var lrcObj = [];
       for (var i=0; i<lrcArr.length; i++) {
           var s = '';
           var l = '';
           lrcArr[i].replace(/\[(.+)\](.+)↵/i, function($0, $1, $2) {
               s = covSec($1);
               l = $2;
           });
           lrcObj.push({
               s: s,
               l: l
           })
       }

       var str = '';
       for(var i=0;i<lrcObj.length;i++){
           str += '<li>'+lrcObj[i].l+'</li>';
       }
       $(".citelist").html(str);

       console.log(showLrc(currentTime));
       function showLrc(ct) {
           var lrc = '';
           for (var i=0; i<lrcObj.length; i++) {
               var s = parseInt(lrcObj[i].s);
               if (ct < s) {
                   break;
               }
               lrc = lrcObj[i].l;
           }
           return lrc;
       }

       //让歌曲中的歌词高亮
       renderlrc(hh,showLrc(currentTime));
       function  renderlrc(ele,str) {
           var lis = ele.get(0).getElementsByTagName("li");
           var n= parseFloat(getComputedStyle(lis[0]).height);
           for(var i=0;i<lis.length;i++){
               if(lis[i].innerHTML == str){
                   lis[i].style.color="red";
                   if(i > 4){
                       ele.get(0).style.top = -n*(i-2.2)+'px';
                   }
               }else{
                   lis[i].className = '';
               }
           }
       }
   }



    function covSec(str) {
        return str.replace(/(\d+)\:(\d+\.\d+)/, function($0, $1, $2) {
            var m = Number($1 * 60);
            return  m + Number($2);
        });
    }



